josephcabrera-cmyk/Blindsight-Claritone-Senior-Design/Object Detection/STM32N6/Middlewares/stm32-mw-camera/cmw_camera.c
  ret = Camera_Drv.ListWBRefModes(&camera_bsp, RefColorTemp);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = CMW_ERROR_NONE;
  /* Return CMW status */
  return ret;
}

/**
  * @brief  Probe camera sensor.
  * @param  initValues  Initialization values for the sensor
  * @param  sensorName  Camera sensor name
  * @retval CMW status
  */
static int CMW_CAMERA_Probe_Sensor(CMW_Sensor_Init_t *initValues, CMW_Sensor_Name_t *sensorName)
{
  int ret;
#if defined(USE_OV5640_SENSOR)
  ret = CMW_CAMERA_OV5640_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_OV5640_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD55G1_SENSOR)
  CMW_CAMERA_DebugLog("CMW PROBE: trying VD55G1");
  ret = CMW_CAMERA_VD55G1_Init(initValues);
  CMW_CAMERA_DebugLogRet("CMW PROBE: VD55G1 ret", ret);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD55G1_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD65G4_SENSOR)
  ret = CMW_CAMERA_VD65G4_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD65G4_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD66GY_SENSOR)
  ret = CMW_CAMERA_VD66GY_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD66GY_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD56G3_SENSOR)
  ret = CMW_CAMERA_VD56G3_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD56G3_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD1943_SENSOR)
  ret = CMW_CAMERA_VD1943_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD1943_Sensor;
    return ret;
  }
#endif
#if defined(USE_VD5943_SENSOR)
  ret = CMW_CAMERA_VD5943_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_VD5943_Sensor;
    return ret;
  }
#endif
#if defined(USE_IMX335_SENSOR)
  ret = CMW_CAMERA_IMX335_Init(initValues);
  if (ret == CMW_ERROR_NONE)
  {
    *sensorName = CMW_IMX335_Sensor;
    return ret;
  }
#endif
  else
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
}



/**
  * @brief  Initializes the camera.
  * @param  initConf  Mandatory: General camera config
  * @param  advanced_config  Optional: Sensor specific configuration
  * @retval CMW status
  */
int32_t CMW_CAMERA_Init(CMW_CameraInit_t *initConf, CMW_Advanced_Config_t *advanced_config)
{
  int32_t ret = CMW_ERROR_NONE;
  CMW_Sensor_Init_t initValues = {0};
  ISP_SensorInfoTypeDef info = {0};

  CMW_CAMERA_DebugLog("CMW INIT: start");

  initValues.width = initConf->width;
  initValues.height = initConf->height;
  initValues.fps = initConf->fps;
  initValues.mirrorFlip = initConf->mirror_flip;

  if ((advanced_config != NULL) && (advanced_config->selected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* Assume The sensor is the one selected by the application. Check during probe */
    connected_sensor = advanced_config->selected_sensor;
    initValues.sensor_config = (void *) &advanced_config->config_sensor;
  }
  else
  {
    connected_sensor = CMW_UNKNOWN_Sensor;
    initValues.sensor_config = NULL;
  }

  /* Set DCMIPP instance */
  hcamera_dcmipp.Instance = DCMIPP;

  /* Configure DCMIPP clock */
  CMW_CAMERA_DebugLog("CMW INIT: MX_DCMIPP_ClockConfig");
  ret = MX_DCMIPP_ClockConfig(&hcamera_dcmipp);
  CMW_CAMERA_DebugLogRet("CMW INIT: MX_DCMIPP_ClockConfig ret", ret);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }
  /* Enable DCMIPP clock */
  CMW_CAMERA_DebugLog("CMW INIT: HAL_DCMIPP_Init");
  ret = HAL_DCMIPP_Init(&hcamera_dcmipp);
  CMW_CAMERA_DebugLogRet("CMW INIT: HAL_DCMIPP_Init ret", ret);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  CMW_CAMERA_DebugLog("CMW INIT: enable GPIOs");
  CMW_CAMERA_EnableGPIOs();
  CMW_CAMERA_DebugLog("CMW INIT: GPIOs enabled");

  CMW_CAMERA_DebugLog("CMW INIT: probe sensor");
  ret = CMW_CAMERA_Probe_Sensor(&initValues, &connected_sensor);
  CMW_CAMERA_DebugLogRet("CMW INIT: probe sensor ret", ret);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }

  /* Configure exposure and gain for a more suitable quality */
  CMW_CAMERA_DebugLog("CMW INIT: get sensor info");
  ret = CMW_CAMERA_GetSensorInfo(&info);
  CMW_CAMERA_DebugLogRet("CMW INIT: get sensor info ret", ret);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
  CMW_CAMERA_DebugLogRet("CMW INIT: exposure_min", info.exposure_min);
  CMW_CAMERA_DebugLogRet("CMW INIT: gain_min", info.gain_min);

  CMW_CAMERA_DebugLog("CMW INIT: set exposure");
  ret = CMW_CAMERA_SetExposure(info.exposure_min);
  CMW_CAMERA_DebugLogRet("CMW INIT: set exposure ret", ret);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }
  CMW_CAMERA_DebugLog("CMW INIT: set gain");
  ret = CMW_CAMERA_SetGain(info.gain_min);
  CMW_CAMERA_DebugLogRet("CMW INIT: set gain ret", ret);
  if (ret == CMW_ERROR_COMPONENT_FAILURE)
  {
    return CMW_ERROR_UNKNOWN_COMPONENT;
  }

  /* Write back the initValue width and height that might be changed */
  initConf->width = initValues.width;
  initConf->height = initValues.height ;
  camera_conf = *initConf;

  is_camera_init++;
  /* CMW status */
  ret = CMW_ERROR_NONE;
  CMW_CAMERA_DebugLog("CMW INIT: success");
  return ret;
}

/**
  * @brief  Set the camera Mirror/Flip.
  * @param  MirrorFlip CMW_MIRRORFLIP_NONE CMW_MIRRORFLIP_FLIP CMW_MIRRORFLIP_MIRROR CMW_MIRRORFLIP_FLIP_MIRROR
  * @retval CMW status
*/
int32_t CMW_CAMERA_SetMirrorFlip(int32_t MirrorFlip)
{
  int ret;

  if (Camera_Drv.SetMirrorFlip == NULL)
  {
    return CMW_ERROR_FEATURE_NOT_SUPPORTED;
  }

  ret = Camera_Drv.SetMirrorFlip(&camera_bsp, MirrorFlip);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  camera_conf.mirror_flip = MirrorFlip;
  ret = CMW_ERROR_NONE;
  /* Return CMW status */
  return ret;
}

/**
  * @brief  Get the camera Mirror/Flip.
  * @param  MirrorFlip CMW_MIRRORFLIP_NONE CMW_MIRRORFLIP_FLIP CMW_MIRRORFLIP_MIRROR CMW_MIRRORFLIP_FLIP_MIRROR
  * @retval CMW status
*/
int32_t CMW_CAMERA_GetMirrorFlip(int32_t *MirrorFlip)
{
  *MirrorFlip = camera_conf.mirror_flip;
  return CMW_ERROR_NONE;
}

/**
  * @brief  Starts the camera capture in the selected mode.
  * @param  pipe  DCMIPP Pipe
  * @param  pbuff pointer to the camera output buffer
  * @param  mode  CMW_MODE_CONTINUOUS or CMW_MODE_SNAPSHOT
  * @retval CMW status
  */
int32_t CMW_CAMERA_Start(uint32_t pipe, uint8_t *pbuff, uint32_t mode)
{
  int32_t ret = CMW_ERROR_NONE;

  if (pipe >= DCMIPP_NUM_OF_PIPES)
  {
    return CMW_ERROR_WRONG_PARAM;
  }

  ret = HAL_DCMIPP_CSI_PIPE_Start(&hcamera_dcmipp, pipe, DCMIPP_VIRTUAL_CHANNEL0, (uint32_t)pbuff, mode);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  if (!is_camera_started)
  {
    ret = Camera_Drv.Start(&camera_bsp);
    if (ret != CMW_ERROR_NONE)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
    is_camera_started++;
  }

  /* Return CMW status */
  return ret;
}

#if defined (STM32N657xx)
/**
  * @brief  Starts the camera capture in the selected mode.
  * @param  pipe  DCMIPP Pipe
  * @param  pbuff1 pointer to the first camera output buffer
  * @param  pbuff2 pointer to the second camera output buffer
  * @param  mode  CMW_MODE_CONTINUOUS or CMW_MODE_SNAPSHOT
  * @retval CMW status
  */
int32_t CMW_CAMERA_DoubleBufferStart(uint32_t pipe, uint8_t *pbuff1, uint8_t *pbuff2, uint32_t Mode)
{
  int32_t ret = CMW_ERROR_NONE;

  if (pipe >= DCMIPP_NUM_OF_PIPES)
  {
    return CMW_ERROR_WRONG_PARAM;
  }

  if (HAL_DCMIPP_CSI_PIPE_DoubleBufferStart(&hcamera_dcmipp, pipe, DCMIPP_VIRTUAL_CHANNEL0, (uint32_t)pbuff1,
                                            (uint32_t)pbuff2, Mode) != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  if (!is_camera_started)
  {
    ret = Camera_Drv.Start(&camera_bsp);
    if (ret != CMW_ERROR_NONE)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
    is_camera_started++;
  }

  /* Return CMW status */
  return ret;
}
#endif




/**
  * @brief  DCMIPP Clock Config for DCMIPP.
  * @param  hdcmipp  DCMIPP Handle
  *         Being __weak it can be overwritten by the application
  * @retval HAL_status
  */
__weak HAL_StatusTypeDef MX_DCMIPP_ClockConfig(DCMIPP_HandleTypeDef *hdcmipp)
{
  UNUSED(hdcmipp);

  return HAL_OK;
}

/**
  * @brief  DeInitializes the camera.
  * @retval CMW status
  */
int32_t CMW_CAMERA_DeInit(void)
{
  int32_t ret = CMW_ERROR_NONE;

  if (HAL_DCMIPP_PIPE_GetState(&hcamera_dcmipp, DCMIPP_PIPE1) != HAL_DCMIPP_PIPE_STATE_RESET)
  {
    ret = HAL_DCMIPP_CSI_PIPE_Stop(&hcamera_dcmipp, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }

  if (HAL_DCMIPP_PIPE_GetState(&hcamera_dcmipp, DCMIPP_PIPE2) != HAL_DCMIPP_PIPE_STATE_RESET)
  {
    ret = HAL_DCMIPP_CSI_PIPE_Stop(&hcamera_dcmipp, DCMIPP_PIPE2, DCMIPP_VIRTUAL_CHANNEL0);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }

  ret = HAL_DCMIPP_DeInit(&hcamera_dcmipp);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

