josephcabrera-cmyk/Blindsight-Claritone-Senior-Design/Object Detection/STM32N6/Middlewares/stm32-mw-camera/cmw_camera.c
static ISP_StatusTypeDef CB_ISP_GetSensorExposure(uint32_t camera_instance, int32_t *exposure)
{
  if (CMW_CAMERA_GetExposure(exposure) != CMW_ERROR_NONE)
    return ISP_ERR_SENSOREXPOSURE;

  return ISP_OK;
}

static ISP_StatusTypeDef CB_ISP_GetSensorInfo(uint32_t camera_instance, ISP_SensorInfoTypeDef *Info)
{
  if(Camera_Drv.GetSensorInfo != NULL)
  {
    if (Camera_Drv.GetSensorInfo(&camera_bsp, Info) != CMW_ERROR_NONE)
      return ISP_ERR_SENSOREXPOSURE;
  }
  return ISP_OK;
}
#endif

#if defined(USE_VD55G1_SENSOR)
static int32_t CMW_CAMERA_VD55G1_Init( CMW_Sensor_Init_t *initSensors_params)
{
  int32_t ret = CMW_ERROR_NONE;
  DCMIPP_CSI_ConfTypeDef csi_conf = { 0 };
  DCMIPP_CSI_PIPE_ConfTypeDef csi_pipe_conf = { 0 };
  uint32_t dt_format = 0;
  uint32_t dt = 0;
  CMW_VD55G1_config_t default_sensor_config;
  CMW_VD55G1_config_t *sensor_config;

  CMW_CAMERA_DebugLog("VD55G1 INIT: start");

  memset(&camera_bsp, 0, sizeof(camera_bsp));
  camera_bsp.vd55g1_bsp.Address     = CAMERA_VD55G1_ADDRESS;
  camera_bsp.vd55g1_bsp.Init        = CMW_I2C_INIT;
  camera_bsp.vd55g1_bsp.DeInit      = CMW_I2C_DEINIT;
  camera_bsp.vd55g1_bsp.WriteReg    = CMW_I2C_WRITEREG16;
  camera_bsp.vd55g1_bsp.ReadReg     = CMW_I2C_READREG16;
  camera_bsp.vd55g1_bsp.Delay       = HAL_Delay;
  camera_bsp.vd55g1_bsp.ShutdownPin = CMW_CAMERA_ShutdownPin;
  camera_bsp.vd55g1_bsp.EnablePin   = CMW_CAMERA_EnablePin;

  CMW_CAMERA_DebugLog("VD55G1 INIT: probe");
  ret = CMW_VD55G1_Probe(&camera_bsp.vd55g1_bsp, &Camera_Drv);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: probe ret", ret);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if ((connected_sensor != CMW_VD55G1_Sensor) && (connected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* If the selected sensor in the application side has selected a different sensors than VD55G1 */
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  /* Special case: when resolution is not specified take the full sensor resolution */
  if ((initSensors_params->width == 0) || (initSensors_params->height == 0))
  {
    initSensors_params->width = VD55G1_MAX_WIDTH;
    initSensors_params->height = VD55G1_MAX_HEIGHT;
  }

  CMW_VD55G1_SetDefaultSensorValues(&default_sensor_config);
  initSensors_params->sensor_config = initSensors_params->sensor_config ? initSensors_params->sensor_config : &default_sensor_config;
  sensor_config = (CMW_VD55G1_config_t*) (initSensors_params->sensor_config);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: width", (int32_t) initSensors_params->width);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: height", (int32_t) initSensors_params->height);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: fps", (int32_t) initSensors_params->fps);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: pixel_format", (int32_t) sensor_config->pixel_format);

  CMW_CAMERA_DebugLog("VD55G1 INIT: Camera_Drv.Init");
  ret = Camera_Drv.Init(&camera_bsp, initSensors_params);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: Camera_Drv.Init ret", ret);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  csi_conf.NumberOfLanes = DCMIPP_CSI_ONE_DATA_LANE;
  csi_conf.DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csi_conf.PHYBitrate = DCMIPP_CSI_PHY_BT_800;
  CMW_CAMERA_DebugLogU32("VD55G1 INIT: lanes", csi_conf.NumberOfLanes);
  CMW_CAMERA_DebugLog("VD55G1 INIT: HAL_DCMIPP_CSI_SetConfig");
  ret = HAL_DCMIPP_CSI_SetConfig(&hcamera_dcmipp, &csi_conf);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: HAL_DCMIPP_CSI_SetConfig ret", ret);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  switch (sensor_config->pixel_format)
  {
    case CMW_PIXEL_FORMAT_RAW8:
    {
      dt_format = DCMIPP_CSI_DT_BPP8;
      dt = DCMIPP_DT_RAW8;
      break;
    }
    case CMW_PIXEL_FORMAT_RAW10:
    case CMW_PIXEL_FORMAT_DEFAULT:
    {
      dt_format = DCMIPP_CSI_DT_BPP10;
      dt = DCMIPP_DT_RAW10;
      break;
    }
    default:
      return CMW_ERROR_COMPONENT_FAILURE;
  }

  CMW_CAMERA_DebugLogU32("VD55G1 INIT: dt_format", dt_format);
  CMW_CAMERA_DebugLogU32("VD55G1 INIT: dt", dt);
  CMW_CAMERA_DebugLog("VD55G1 INIT: HAL_DCMIPP_CSI_SetVCConfig");
  ret = HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, DCMIPP_VIRTUAL_CHANNEL0, dt_format);
  CMW_CAMERA_DebugLogRet("VD55G1 INIT: HAL_DCMIPP_CSI_SetVCConfig ret", ret);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  csi_pipe_conf.DataTypeMode = DCMIPP_DTMODE_DTIDA;
  csi_pipe_conf.DataTypeIDA = dt;
  csi_pipe_conf.DataTypeIDB = 0;
  /* Pre-initialize CSI config for all the pipes */
  for (uint32_t i = DCMIPP_PIPE0; i <= DCMIPP_PIPE2; i++)
  {
    CMW_CAMERA_DebugLogU32("VD55G1 INIT: HAL_DCMIPP_CSI_PIPE_SetConfig pipe", i);
    ret = HAL_DCMIPP_CSI_PIPE_SetConfig(&hcamera_dcmipp, i, &csi_pipe_conf);
    CMW_CAMERA_DebugLogRet("VD55G1 INIT: HAL_DCMIPP_CSI_PIPE_SetConfig ret", ret);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }

  CMW_CAMERA_DebugLog("VD55G1 INIT: success");
  return CMW_ERROR_NONE;
}
#endif

#if defined(USE_VD65G4_SENSOR)
static int32_t CMW_CAMERA_VD65G4_Init( CMW_Sensor_Init_t *initSensors_params)
{
  int32_t ret = CMW_ERROR_NONE;
  DCMIPP_CSI_ConfTypeDef csi_conf = { 0 };
  DCMIPP_CSI_PIPE_ConfTypeDef csi_pipe_conf = { 0 };
  uint32_t dt_format = 0;
  uint32_t dt = 0;
  CMW_VD65G4_config_t default_sensor_config;
  CMW_VD65G4_config_t *sensor_config;

  memset(&camera_bsp, 0, sizeof(camera_bsp));
  camera_bsp.vd65g4_bsp.Address     = CAMERA_VD65G4_ADDRESS;
  camera_bsp.vd65g4_bsp.Init        = CMW_I2C_INIT;
  camera_bsp.vd65g4_bsp.DeInit      = CMW_I2C_DEINIT;
  camera_bsp.vd65g4_bsp.WriteReg    = CMW_I2C_WRITEREG16;
  camera_bsp.vd65g4_bsp.ReadReg     = CMW_I2C_READREG16;
  camera_bsp.vd65g4_bsp.Delay       = HAL_Delay;
  camera_bsp.vd65g4_bsp.ShutdownPin = CMW_CAMERA_ShutdownPin;
  camera_bsp.vd65g4_bsp.EnablePin   = CMW_CAMERA_EnablePin;

  ret = CMW_VD65G4_Probe(&camera_bsp.vd65g4_bsp, &Camera_Drv);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if ((connected_sensor != CMW_VD65G4_Sensor) && (connected_sensor != CMW_UNKNOWN_Sensor))
  {
    /* If the selected sensor in the application side has selected a different sensors than VD65G4 */
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  /* Special case: when resolution is not specified take the full sensor resolution */
  if ((initSensors_params->width == 0U) || (initSensors_params->height == 0U))
  {
    initSensors_params->width = VD55G1_MAX_WIDTH;
    initSensors_params->height = VD55G1_MAX_HEIGHT;
  }

  CMW_VD65G4_SetDefaultSensorValues(&default_sensor_config);
  initSensors_params->sensor_config = initSensors_params->sensor_config ? initSensors_params->sensor_config : &default_sensor_config;
  sensor_config = (CMW_VD65G4_config_t*)(initSensors_params->sensor_config);

  ret = Camera_Drv.Init(&camera_bsp, initSensors_params);
  if (ret != CMW_ERROR_NONE)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  csi_conf.NumberOfLanes = DCMIPP_CSI_ONE_DATA_LANE;
  csi_conf.DataLaneMapping = DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csi_conf.PHYBitrate = DCMIPP_CSI_PHY_BT_800;
  ret = HAL_DCMIPP_CSI_SetConfig(&hcamera_dcmipp, &csi_conf);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  switch (sensor_config->pixel_format)
  {
    case CMW_PIXEL_FORMAT_RAW8:
    {
      dt_format = DCMIPP_CSI_DT_BPP8;
      dt = DCMIPP_DT_RAW8;
      break;
    }
    case CMW_PIXEL_FORMAT_RAW10:
    case CMW_PIXEL_FORMAT_DEFAULT:
    {
      dt_format = DCMIPP_CSI_DT_BPP10;
      dt = DCMIPP_DT_RAW10;
      break;
    }
    default:
      return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, DCMIPP_VIRTUAL_CHANNEL0, dt_format);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_PERIPH_FAILURE;
  }

  csi_pipe_conf.DataTypeMode = DCMIPP_DTMODE_DTIDA;
  csi_pipe_conf.DataTypeIDA = dt;
  csi_pipe_conf.DataTypeIDB = 0U;
  /* Pre-initialize CSI config for all the pipes */
  for (uint32_t i = DCMIPP_PIPE0; i <= DCMIPP_PIPE2; i++)
  {
    ret = HAL_DCMIPP_CSI_PIPE_SetConfig(&hcamera_dcmipp, i, &csi_pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_PERIPH_FAILURE;
    }
  }

