josephcabrera-cmyk/Blindsight-Claritone-Senior-Design/Object Detection/STM32N6/Middlewares/stm32-mw-camera/cmw_camera.c
static int32_t CMW_CAMERA_SetPipe(DCMIPP_HandleTypeDef *hdcmipp, uint32_t pipe, CMW_DCMIPP_Conf_t *p_conf, uint32_t *pitch)
{
  DCMIPP_DecimationConfTypeDef dec_conf = { 0 };
  DCMIPP_PipeConfTypeDef pipe_conf = { 0 };
  DCMIPP_DownsizeTypeDef down_conf = { 0 };
  DCMIPP_CropConfTypeDef crop_conf = { 0 };
  int ret;

  /* specific case for pipe0 which is only a dump pipe */
  if (pipe == DCMIPP_PIPE0)
  {
    /*  TODO: properly configure the dump pipe with decimation and crop */
    pipe_conf.FrameRate = DCMIPP_FRAME_RATE_ALL;
    ret = HAL_DCMIPP_PIPE_SetConfig(hdcmipp, pipe, &pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    return CMW_ERROR_NONE;
  }

  CMW_UTILS_GetPipeConfig(camera_conf.width, camera_conf.height, p_conf, &crop_conf, &dec_conf, &down_conf);

  if (crop_conf.VSize != 0 || crop_conf.HSize != 0)
  {
    ret = HAL_DCMIPP_PIPE_SetCropConfig(hdcmipp, pipe, &crop_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    ret = HAL_DCMIPP_PIPE_EnableCrop(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableCrop(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  if (dec_conf.VRatio != 0 || dec_conf.HRatio != 0)
  {
    ret = HAL_DCMIPP_PIPE_SetDecimationConfig(hdcmipp, pipe, &dec_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    ret = HAL_DCMIPP_PIPE_EnableDecimation(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableDecimation(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  ret = HAL_DCMIPP_PIPE_SetDownsizeConfig(hdcmipp, pipe, &down_conf);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  ret = HAL_DCMIPP_PIPE_EnableDownsize(hdcmipp, pipe);
  if (ret != HAL_OK)
  {
    return CMW_ERROR_COMPONENT_FAILURE;
  }

  if (p_conf->enable_swap)
  {
    /* Config pipe */
    ret = HAL_DCMIPP_PIPE_EnableRedBlueSwap(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    ret = HAL_DCMIPP_PIPE_DisableRedBlueSwap(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Ignore the configuration of gamma if -1
   * Activation is then done by the ISP Library
   */
  if (p_conf->enable_gamma_conversion > -1)
  {
    if (p_conf->enable_gamma_conversion)
    {
      ret = HAL_DCMIPP_PIPE_EnableGammaConversion(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
    }
    else
    {
      ret = HAL_DCMIPP_PIPE_DisableGammaConversion(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
    }
  }

  if (pipe == DCMIPP_PIPE2)
  {
    if (!is_pipe1_2_shared)
    {
      ret = HAL_DCMIPP_PIPE_CSI_EnableShare(hdcmipp, pipe);
      if (ret != HAL_OK)
      {
        return CMW_ERROR_COMPONENT_FAILURE;
      }
      is_pipe1_2_shared++;
    }
  }

  pipe_conf.FrameRate = DCMIPP_FRAME_RATE_ALL;
  pipe_conf.PixelPipePitch = p_conf->output_width * p_conf->output_bpp;
  /* Hardware constraint, pitch must be multiple of 16 */
  pipe_conf.PixelPipePitch = (pipe_conf.PixelPipePitch + 15) & (uint32_t) ~15;
  pipe_conf.PixelPackerFormat = p_conf->output_format;

  /* Support of YUV pixel format */
  if (pipe_conf.PixelPackerFormat == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1)
  {
    if (pipe != DCMIPP_PIPE1)
    {
      /* Only pipe 1 support YUV conversion */
      return CMW_ERROR_FEATURE_NOT_SUPPORTED;
    }

    #define N10(val) (((val) ^ 0x7FF) + 1)
    DCMIPP_ColorConversionConfTypeDef yuv_color_conf = {
    .ClampOutputSamples = ENABLE,
    .OutputSamplesType = 0,
    .RR = 131,     .RG = N10(110), .RB = N10(21), .RA = 128,
    .GR = 77,      .GG = 150,      .GB = 29,      .GA = 0,
    .BR = N10(44), .BG = N10(87),  .BB = 131,     .BA = 128,
    };

    ret = HAL_DCMIPP_PIPE_SetYUVConversionConfig(hdcmipp, pipe, &yuv_color_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
    ret = HAL_DCMIPP_PIPE_EnableYUVConversion(hdcmipp, pipe);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  if (hcamera_dcmipp.PipeState[pipe] == HAL_DCMIPP_PIPE_STATE_RESET)
  {
    ret = HAL_DCMIPP_PIPE_SetConfig(hdcmipp, pipe, &pipe_conf);
    if (ret != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }
  else
  {
    if (HAL_DCMIPP_PIPE_SetPixelPackerFormat(hdcmipp, pipe, pipe_conf.PixelPackerFormat) != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }

    if (HAL_DCMIPP_PIPE_SetPitch(hdcmipp, pipe, pipe_conf.PixelPipePitch) != HAL_OK)
    {
      return CMW_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Update the pitch field so that application can use this information for
   * buffer alignement */
  *pitch = pipe_conf.PixelPipePitch;

  return CMW_ERROR_NONE;
}

int32_t CMW_CAMERA_SetDefaultSensorValues( CMW_Advanced_Config_t *advanced_config )
{
  if (advanced_config == NULL)
  {
    return CMW_ERROR_WRONG_PARAM;
  }
  switch (advanced_config->selected_sensor)
  {
#if defined(USE_VD66GY_SENSOR)
  case CMW_VD66GY_Sensor:
    CMW_VD66GY_SetDefaultSensorValues(&advanced_config->config_sensor.vd66gy_config);
    break;
#endif
#if defined(USE_VD55G1_SENSOR)
  case CMW_VD55G1_Sensor:
    CMW_VD55G1_SetDefaultSensorValues(&advanced_config->config_sensor.vd55g1_config);
    break;
#endif
#if defined(USE_VD65G4_SENSOR)
  case CMW_VD65G4_Sensor:
    CMW_VD65G4_SetDefaultSensorValues(&advanced_config->config_sensor.vd65g4_config);
    break;
#endif
#if defined(USE_IMX335_SENSOR)
  case CMW_IMX335_Sensor:
    CMW_IMX335_SetDefaultSensorValues(&advanced_config->config_sensor.imx335_config);
    break;
#endif
#if defined(USE_OV5640_SENSOR)
  case CMW_OV5640_Sensor:
    CMW_OV5640_SetDefaultSensorValues(&advanced_config->config_sensor.ov5640_config);
    break;
#endif
#if defined(USE_VD1943_SENSOR)
  case CMW_VD1943_Sensor:
    CMW_VD1943_SetDefaultSensorValues(&advanced_config->config_sensor.vd1943_config);
    break;
#endif
#if defined(USE_VD5943_SENSOR)
  case CMW_VD5943_Sensor:
    CMW_VD5943_SetDefaultSensorValues(&advanced_config->config_sensor.vd5943_config);
    break;
#endif
  default:
    return CMW_ERROR_WRONG_PARAM;
    break;
  }

  return CMW_ERROR_NONE;
}

/**
  * @brief  Error callback on the pipe. Occurs when overrun occurs on the pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval None
  */
void HAL_DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  UNUSED(hdcmipp);

  CMW_CAMERA_PIPE_ErrorCallback(Pipe);
}
